[
  {
    "price": 2540000,
    "propertyType": "Villa",
    "numOfBedrooms": 6,
    "numOfBathrooms": 3,
    "location": "France, Paris",
    "photos": [
      "/listings_photos/villas (1).png",
      "villa_photo2.jpg",
      "villa_photo3.jpg"
    ],
    "id": 1,
    "area": 750,
    "condition": "New",
    "description": "This elegant villa is a testament to luxury living in the heart of Paris. Boasting six bedrooms, three bathrooms, and sprawling across 750 square meters, it offers ample space for both relaxation and entertainment. The interiors are adorned with high-end finishes and designer touches, creating an atmosphere of opulence and sophistication. Step outside to discover a private garden oasis, where lush greenery and fragrant blooms provide a serene escape from the hustle and bustle of city life. Whether you're hosting lavish gatherings or enjoying quiet moments of solitude, this villa epitomizes the epitome of refined living in one of the world's most prestigious locales."
  },
  {
    "price": 340000,
    "propertyType": "Apartment",
    "numOfBedrooms": 2,
    "numOfBathrooms": 1,
    "location": "Spain, Barcelona",
    "photos": [
      "/listings_photos/apartaments (1).png",
      "apartment_photo2.jpg",
      "apartment_photo3.jpg"
    ],
    "id": 2,
    "area": 120,
    "condition": "Good Condition",
    "description": "Discover modern city living at its finest in this stylish Barcelona apartment. Situated in a vibrant neighborhood, this two-bedroom, one-bathroom residence offers a perfect blend of comfort and convenience. The open-plan layout features sleek finishes and abundant natural light, creating a welcoming ambiance for residents and guests alike. From the spacious living area to the well-appointed kitchen, every corner of this apartment is designed with both aesthetics and functionality in mind. Step outside onto the private balcony and soak in panoramic views of the city skyline, or venture out to explore the countless attractions and amenities just steps away. With its prime location and contemporary design, this apartment is an ideal choice for those seeking the ultimate urban lifestyle."
  },
  {
    "price": 980000,
    "propertyType": "House",
    "numOfBedrooms": 4,
    "numOfBathrooms": 2,
    "location": "USA, Los Angeles",
    "photos": [
      "/listings_photos/houses (5).png",
      "house_photo2.jpg",
      "house_photo3.jpg"
    ],
    "id": 3,
    "area": 300,
    "condition": "Good Condition",
    "description": "Welcome to your dream home in the heart of Los Angeles. This charming house offers the perfect blend of comfort, convenience, and California living. With four bedrooms, two bathrooms, and 300 square meters of living space, it provides ample room for families of all sizes. The spacious interiors are filled with natural light and feature stylish finishes and modern amenities throughout. Outside, the expansive backyard is a true oasis, complete with lush landscaping, a sparkling pool, and plenty of space for outdoor entertaining. Located in a prime neighborhood with easy access to shops, restaurants, and entertainment, this house is the epitome of West Coast living at its finest."
  },
  {
    "price": 1630000,
    "propertyType": "Villa",
    "numOfBedrooms": 6,
    "numOfBathrooms": 4,
    "location": "Italy, Rome",
    "photos": [
      "/listings_photos/villas (2).png",
      "villa_photo2.jpg",
      "villa_photo3.jpg"
    ],
    "id": 4,
    "area": 600,
    "condition": "Good Condition",
    "description": "Experience la dolce vita in this magnificent villa nestled in the heart of Rome. With six bedrooms, four bathrooms, and 600 square meters of living space, it offers the ultimate in luxury and comfort. The interiors are beautifully appointed with exquisite finishes, elegant furnishings, and every modern convenience imaginable. Step outside to discover a private sanctuary, where lush gardens, tranquil courtyards, and a sparkling pool await. Whether you're hosting lavish soirées or enjoying quiet moments with loved ones, this villa provides the perfect backdrop for unforgettable memories. With its prime location and timeless elegance, it's no wonder that this property is considered one of Rome's most prestigious addresses."
  },
  {
    "price": 120000,
    "propertyType": "Apartment",
    "numOfBedrooms": 1,
    "numOfBathrooms": 1,
    "location": "Germany, Berlin",
    "photos": [
      "/listings_photos/apartaments (3).png",
      "apartment_photo2.jpg",
      "apartment_photo3.jpg"
    ],
    "id": 5,
    "area": 80,
    "condition": "To Be Repaired",
    "description": "Uncover the potential of this charming Berlin apartment, nestled in a vibrant neighborhood teeming with culture and excitement. Featuring one bedroom, one bathroom, and 80 square meters of living space, it's the perfect canvas for your renovation dreams. The cozy interiors offer a blank slate for your personal touches, whether you envision a sleek modern retreat or a cozy vintage escape. Outside, the bustling streets of Berlin beckon, with world-class dining, shopping, and entertainment just moments away. With its prime location and endless possibilities, this apartment offers the opportunity to create the home of your dreams in one of Europe's most dynamic cities."
  },
  {
    "price": 850000,
    "propertyType": "House",
    "numOfBedrooms": 5,
    "numOfBathrooms": 3,
    "location": "UK, London",
    "photos": [
      "/listings_photos/houses (3).png",
      "house_photo2.jpg",
      "house_photo3.jpg"
    ],
    "id": 6,
    "area": 400,
    "condition": "Good Condition",
    "description": "Escape to your own private sanctuary in the heart of London with this exquisite house. Boasting five bedrooms, three bathrooms, and 400 square meters of living space, it offers the perfect blend of luxury and comfort. The interiors are tastefully appointed with high-end finishes and designer touches throughout, creating an atmosphere of elegance and sophistication. Outside, the lush garden oasis provides a tranquil retreat from the hustle and bustle of city life, with ample space for outdoor entertaining and relaxation. Located in a prime neighborhood with easy access to shops, restaurants, and transportation, this house is the epitome of London living at its finest."
  },
  {
    "price": 1290000,
    "propertyType": "Villa",
    "numOfBedrooms": 4,
    "numOfBathrooms": 3,
    "location": "France, Nice",
    "photos": [
      "/listings_photos/villas (3).png",
      "villa_photo2.jpg",
      "villa_photo3.jpg"
    ],
    "id": 7,
    "area": 550,
    "condition": "Good Condition",
    "description": "Indulge in the ultimate luxury lifestyle with this stunning villa in the picturesque city of Nice. With four bedrooms, three bathrooms, and 550 square meters of living space, it offers an unrivaled combination of elegance and comfort. The interiors are meticulously designed with exquisite finishes and upscale furnishings, creating a lavish retreat for residents and guests alike. Step outside to discover a private paradise, complete with lush gardens, a sparkling pool, and breathtaking views of the Mediterranean Sea. Whether you're relaxing in the sun-drenched courtyard or entertaining guests in the spacious living areas, this villa provides the perfect backdrop for unforgettable moments. With its prime location and timeless beauty, it's no wonder that this property is considered one of the French Riviera's most coveted addresses."
  },
  {
    "price": 980000,
    "propertyType": "Apartment",
    "numOfBedrooms": 3,
    "numOfBathrooms": 2,
    "location": "Spain, Madrid",
    "photos": [
      "/listings_photos/apartaments (6).png",
      "apartment_photo2.jpg",
      "apartment_photo3.jpg"
    ],
    "id": 8,
    "area": 150,
    "condition": "New",
    "description": "Step into modern luxury with this chic Madrid apartment, located in the heart of the vibrant city center. Featuring three bedrooms, two bathrooms, and 150 square meters of living space, it offers a perfect blend of style and comfort. The interiors are thoughtfully designed with sleek finishes and contemporary furnishings, creating an ambiance of sophistication and refinement. Step outside onto the private terrace and enjoy panoramic views of the city skyline, or explore the countless attractions and amenities just steps away. With its prime location and modern amenities, this apartment is the epitome of urban living at its finest."
  },
  {
    "price": 520000,
    "propertyType": "House",
    "numOfBedrooms": 6,
    "numOfBathrooms": 4,
    "location": "USA, New York",
    "photos": [
      "/listings_photos/houses (2).png",
      "house_photo2.jpg",
      "house_photo3.jpg"
    ],
    "id": 9,
    "area": 350,
    "condition": "To Be Repaired",
    "description": "Discover the potential of this historic New York house, nestled in a prime location just minutes from the bustling streets of Manhattan. With six bedrooms, four bathrooms, and 350 square meters of living space, it offers plenty of room for both living and entertaining. The spacious interiors are filled with natural light and feature original architectural details, creating a unique blend of old-world charm and modern convenience. Step outside to explore the vibrant neighborhood, with its world-class dining, shopping, and cultural attractions just moments away. With its prime location and endless possibilities, this house offers the opportunity to create the home of your dreams in one of the world's most iconic cities."
  },
  {
    "price": 1450000,
    "propertyType": "Villa",
    "numOfBedrooms": 5,
    "numOfBathrooms": 3,
    "location": "Italy, Florence",
    "photos": [
      "/listings_photos/villas (4).png",
      "villa_photo2.jpg",
      "villa_photo3.jpg"
    ],
    "id": 10,
    "area": 600,
    "condition": "Good Condition",
    "description": "Experience the epitome of Tuscan luxury with this exquisite villa nestled in the heart of Florence. With five bedrooms, three bathrooms, and 600 square meters of living space, it offers the perfect blend of elegance and comfort. The interiors are beautifully appointed with timeless finishes and upscale furnishings, creating an ambiance of sophistication and refinement. Step outside to discover a private paradise, complete with lush gardens, a sparkling pool, and breathtaking views of the surrounding countryside. Whether you're relaxing in the sun-drenched courtyard or exploring the charming streets of Florence, this villa provides the perfect backdrop for unforgettable moments. With its prime location and timeless beauty, it's no wonder that this property is considered one of Tuscany's most coveted addresses."
  },
  {
    "price": 450000,
    "propertyType": "Apartment",
    "numOfBedrooms": 2,
    "numOfBathrooms": 1,
    "location": "Germany, Munich",
    "photos": [
      "/listings_photos/apartaments (2).png",
      "apartment_photo2.jpg",
      "apartment_photo3.jpg"
    ],
    "id": 11,
    "area": 100,
    "condition": "Good Condition",
    "description": "Discover the charm of Munich living with this stylish apartment located in the heart of the city. Featuring two bedrooms, one bathroom, and 100 square meters of living space, it offers a perfect blend of comfort and convenience. The interiors are tastefully designed with modern finishes and designer touches throughout, creating an ambiance of sophistication and style. Step outside onto the private balcony and enjoy panoramic views of the city skyline, or explore the countless attractions and amenities just steps away. With its prime location and contemporary design, this apartment is an ideal choice for those seeking the ultimate urban lifestyle."
  },
  {
    "price": 480000,
    "propertyType": "House",
    "numOfBedrooms": 4,
    "numOfBathrooms": 3,
    "location": "UK, Manchester",
    "photos": [
      "/listings_photos/houses (1).png",
      "house_photo2.jpg",
      "house_photo3.jpg"
    ],
    "id": 12,
    "area": 300,
    "condition": "To Be Repaired",
    "description": "Uncover the potential of this charming Manchester house, located in a vibrant neighborhood with easy access to shops, restaurants, and transportation. Featuring four bedrooms, three bathrooms, and 300 square meters of living space, it offers plenty of room for both living and entertaining. The spacious interiors are filled with natural light and feature original architectural details, creating a unique blend of historic charm and modern convenience. Step outside to explore the bustling neighborhood, with its vibrant street life and cultural attractions just moments away. With its prime location and endless possibilities, this house offers the opportunity to create the home of your dreams in one of England's most dynamic cities."
  }
]